app/controllers/schools_controller.rb

  def show
    # byebug
    @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]