app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])
    @school = School.find(@student.school_id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]

  def new
    @student = Student.new
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    student = Student.create(name: params[:student][:name], age: params[:student][:age], school_id: params[:student][:school_id])
---
INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Darrow Palast"], ["age", 21], ["created_at", "2019-08-29 19:15:39.985143"], ["updated_at", "2019-08-29 19:15:39.985143"], ["school_id", 81]]

  def edit
    @student = Student.find(params[:id])
    # @school = School.find()
    @schools = School.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"

  def update
    @student = Student.find(params[:id])
    @student.update(name: params[:student][:name], age: params[:student][:age], school_id: params[:student][:school_id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 81], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 25], ["school_id", 101], ["updated_at", "2019-08-29 21:08:29.845029"], ["id", 81]]

  def delete
    @student = Student.find(params[:id])
    @student.delete
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 80], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 80]]